{"head":{"title":"Dynamically Updating Javascript Resources for React Native if you don’t know what you are doing with Objective-C","date":"2016-06-03T00:00:00.000Z","layout":"Post","description":"For a project at work, I’m creating a React Native app. The nice thing about React Native is you can load the javascript bundle (the brains…"},"body":"<p>For a project at work, I’m creating a React Native app. The nice thing about React Native is you can load the javascript bundle (the brains of the app, so to speak) from a remote server. This means that you can make updates and changes without having to go through the App Store approval process.</p>\n<p>The downside to this is that it takes a second or two to load the bundle before the app itself actually loads. Unless you have some fancy Objective-C or Swift ‘Loading’ animation, it’s just going to show a white screen. I don’t have any experience with iOS programming, so I decided to do the next best thing — load the bundle from the device locally.\nI was able to piece together most of what to do from this guide, but some of it I had to figure out on my own.</p>\n<p><a href=\"https://medium.com/ios-os-x-development/so-you-want-to-dynamically-update-your-react-native-app-d1d88bf11ede#.qzg6q5n3o\">So You Want To Dynamically Update Your React Native App</a></p>\n<p>At work we recently shipped our first React Native components inside an app, and I’ve been mulling how (and if…medium.com\nReact Native gives you the option to have the JS bundle stored in the application bundle, which gives you almost instant load times. I could use that mechanism to do what I wanted.</p>\n<p>First, I needed to check to see if there was a downloaded JS bundle or if I needed to use the app’s bundle:</p>\n<pre><code>//This is the document directory of the app itself.\nNSString *documentDir = [NSSearchPathForDirectoriesInDomains(NSDocumentDirectory, NSUserDomainMask, YES) firstObject];\n//filePath represents where the downloaded bundle resides. It's in the documents directory of the app.\nNSString *filePath = [documentDir stringByAppendingPathComponent:@”main-loaded.jsbundle”];\nNSURL *codeLocation = [NSURL URLWithString:filePath];\n\n//use the application bundle if there is no file in the execution path\nif (![[NSFileManager defaultManager] fileExistsAtPath:filePath]) {\n//Load the app bundle's javascript\njsCodeLocation = [[NSBundle mainBundle] URLForResource:@”main” withExtension:@”jsbundle”];\nNSLog(@”Loaded from application bundle”);\n} else {\n//Load the downloaded Javascript bundle.\njsCodeLocation = codeLocation;\nNSLog(@”Loaded from remote bundle”);\n}\n</code></pre>\n<p>If you just throw this into your AppDelegate.m file, it will load the application bundle every time, since it isn’t downloading anything to the documents folder.</p>\n<p>Next I asynchronously load the Javascript bundle from the remote server (in my case, I use Amazon S3 to host it)</p>\n<pre><code>remoteCode = [NSURL URLWithString:@”https://***path to your javascript bundle***\"];\n//Make the request asynchronously\nNSURLRequest *request = [NSURLRequest requestWithURL:remoteCode];\n[NSURLConnection sendAsynchronousRequest:request queue:[NSOperationQueue currentQueue] completionHandler:^(NSURLResponse *response, NSData *data, NSError *error) {\nif (error) {\nNSLog(@”Download Error:%@”,error.description);\n}\nif (data) {\n//Save the data to the file path\n[data writeToFile:filePath atomically:YES];\nNSLog(@”File is saved to %@”,filePath);\n}\n}];\n</code></pre>\n<p>This is going to download the bundle and save it to the file path, but only after the application has already loaded.</p>\n<p>Finally, use the boilerplate React Native code to insert the React Native view into the Objective-C app.</p>\n<pre><code>RCTRootView *rootView = [[RCTRootView alloc] initWithBundleURL:jsCodeLocation\nmoduleName:@”***Name of your module***”\ninitialProperties:nil\nlaunchOptions:launchOptions];\n</code></pre>\n<p>Now, whenever your app loads, it will use the downloaded version of your Javascript bundle.</p>\n","__filename":"posts/2016-06-03-dynamic-javascript-react-native.md","__url":"/posts/2016-06-03-dynamic-javascript-react-native/","__resourceUrl":"/posts/2016-06-03-dynamic-javascript-react-native/index.html","__dataUrl":"/posts/2016-06-03-dynamic-javascript-react-native/index.html.2e2b7ff0ec25d1077bf6a7bef51ebbc3.json"}